a
abandon
ability
able
abnormal
aboard
abolish
abortion
about
above
abroad
abrupt
absence
absent
absolute
absorb
abstract
absurd
abundant
abuse
academic
academy
accelerate
accent
accept
access
accessible
accident
accommodation
accompany
accomplish
account
accountant
accumulate
accuracy
accurate
accuse
accustomed
ache
achieve
achievement
acid
acknowledge
acquaintance
acquire
acquisition
acre
across
act
action
active
activity
actor
actress
actual
acute
ad
adapt
adaptation
add
addicted
addition
address
adequate
adjust
adjustment
administration
admirable
admire
admission
admit
adolescence
adolescent
adopt
adore
adult
advance
advantage
adventure
advertise
advertisement
advice
advise
advocate
affair
affect
affection
afford
afraid
africa
african
after
afternoon
afterward
afterwards
again
against
age
agency
agenda
agent
aggressive
ago
agree
agreement
agricultural
agriculture
ahead
aid
aids
aim
air
aircraft
airline
airmail
airplane
airport
airspace
alarm
album
alcohol
alcoholic
algebra
alike
alive
all
allergic
alley
allocate
allow
allowance
almost
alone
along
alongside
aloud
alphabet
already
also
alternative
although
altitude
altogether
aluminum
always
am
amateur
amaze
amazing
ambassador
ambassadress
ambiguous
ambition
ambulance
america
among
amount
ample
amuse
amusement
an
analyse
analysis
ancestor
anchor
ancient
and
anecdote
anger
angle
angry
animal
ankle
anniversary
announce
annoy
annual
another
answer
ant
antarctic
antique
anxiety
anxious
any
anybody
anyhow
anyone
anything
anyway
anywhere
apart
apartment
apologize
apology
apparent
appeal
appear
appearance
appendix
appetite
applaud
apple
applicant
application
apply
appoint
appointment
appreciate
appreciation
appropriate
approval
approve
approximately
apron
arbitrary
arch
architecture
arctic
are
area
argue
argument
arise
arithmetic
arm
armchair
army
around
arrange
arrangement
arrest
arrival
arrive
arrow
art
article
artificial
artist
as
ash
ashamed
asia
asian
aside
ask
asleep
aspect
assess
assessment
assist
assistance
assistant
associate
association
assume
assumption
astonish
astronaut
astronomer
astronomy
at
athlete
athletic
atlantic
atmosphere
atom
attach
attack
attain
attempt
attend
attention
attitude
attract
attraction
attractive
audience
aunt
authentic
author
authority
automatic
autonomous
autumn
available
avenue
average
avoid
awake
award
aware
away
awesome
awful
awkward
baby
bachelor
back
background
backward
backwards
bacon
bacteria
bad
badminton
bag
baggage
bakery
balance
balcony
ball
ballet
balloon
bamboo
ban
banana
bandage
bank
bar
barbecue
barber
barbershop
bare
bargain
bark
barrier
base
baseball
basement
basic
basin
basis
basket
basketball
bat
bath
bathe
bathroom
bathtub
battery
battle
bay
bc
be
beach
bean
bear
beard
beast
beat
beautiful
beauty
because
become
bed
beddings
bedroom
bee
beef
beer
before
beg
begin
behalf
behave
behavior
behaviour
behind
being
belief
believe
bell
belly
belong
below
belt
bench
bend
beneath
beneficial
benefit
bent
beside
besides
betray
between
beyond
bicycle
bid
big
bike
bill
bingo
biochemistry
biography
biology
bird
birth
birthday
birthplace
biscuit
bishop
bit
bite
bitter
black
blackboard
blame
blank
blanket
bleed
bless
blind
block
blood
blouse
blow
blue
board
boat
body
boil
bomb
bond
bone
bonus
book
boom
boot
booth
border
bored
boring
born
borrow
boss
botanical
botany
both
bother
bottle
bottom
bounce
bound
boundary
bow
bowl
bowling
box
boxing
boy
boycott
brain
brake
branch
brand
brave
bravery
bread
break
breakfast
breakthrough
breast
breath
breathe
breathless
brewery
brick
bride
bridegroom
bridge
brief
bright
brilliant
bring
broad
broadcast
brochure
broken
broom
brother
brown
brunch
brush
buddhism
budget
buffet
build
building
bunch
bungalow
burden
bureaucratic
burglar
burn
bury
bus
bush
business
businessman
businesswoman
busy
but
butcher
butter
butterfly
button
buy
by
bye
cab
cabbage
cafeteria
cage
cake
calculate
call
calm
camel
camera
camp
campaign
can
cancel
cancer
candidate
candle
candy
canteen
cap
capital
capsule
captain
caption
car
carbon
card
care
careful
careless
carpenter
carpet
carriage
carrier
carrot
carry
cartoon
carve
case
cash
cassette
cast
castle
casual
cat
catalogue
catastrophe
catch
category
cater
catholic
cattle
cause
caution
cautious
cave
cd
ceiling
celebrate
celebration
cell
cent
center
centigrade
centimeter
centimetre
central
centre
century
ceremony
certain
certificate
chain
chair
chairman
chairwoman
chalk
challenge
challenging
champion
chance
change
changeable
channel
chant
chaos
chapter
character
characteristic
charge
chart
chat
cheap
cheat
check
cheek
cheer
cheerful
cheers
cheese
chef
chemical
chemist
chemistry
cheque
chess
chest
chew
chicken
chief
child
childhood
chocolate
choice
choir
choke
choose
chopsticks
chorus
christian
christmas
church
cigar
cigarette
cinema
circle
circuit
circulate
circumstance
citizen
city
civil
civilian
civilization
clap
clarify
class
classic
classify
classmate
classroom
claw
clay
clean
cleaner
clear
clerk
clever
click
climate
climb
clinic
clock
clone
close
cloth
clothes
clothing
cloud
cloudy
club
clumsy
coach
coal
coast
coat
cocoa
coffee
coin
coincidence
coke
cold
collar
colleague
collect
collection
college
collision
color
colour
comb
combine
come
comedy
comfort
comfortable
command
comment
commercial
commit
commitment
committee
common
communicate
communication
communism
communist
companion
company
compare
compass
compensate
compete
competence
competition
complete
complex
component
composition
comprehension
compromise
compulsory
computer
concentrate
concept
concern
concert
conclude
conclusion
concrete
condemn
condition
conduct
conductor
conference
confident
confidential
confirm
conflict
confuse
congratulate
congratulation
connect
connection
conscience
consensus
consequence
conservation
conservative
consider
considerate
consideration
consist
consistent
constant
constitution
construct
construction
consult
consultant
consume
contain
container
contemporary
content
continent
continue
contradict
contradictory
contrary
contribute
contribution
control
controversial
convenience
convenient
conventional
conversation
convey
convince
cook
cooker
cookie
cool
copy
corn
corner
corporation
correct
correction
correspond
corrupt
cost
cosy
cottage
cotton
cough
could
count
counter
country
countryside
couple
courage
course
court
courtyard
cousin
cover
cow
cozy
crash
crayon
crazy
cream
create
creature
credit
crew
crime
criminal
criteria
criterion
crop
cross
crossing
crossroads
crowd
cruel
cry
cube
cubic
cuisine
culture
cup
cupboard
curd
cure
curious
currency
curriculum
curtain
cushion
custom
customer
customs
cut
cycle
cyclist
dad
daddy
daily
dam
damage
damp
dance
danger
dangerous
dare
dark
darkness
dash
data
database
date
daughter
dawn
day
dead
deadline
deaf
deal
dear
death
debate
debt
decade
decide
decision
declare
decline
decorate
decoration
decrease
dedicate
deed
deep
deer
defeat
defence
defend
defense
degree
delay
delete
deliberately
delicious
delight
delighted
deliver
demand
dentist
department
departure
depend
deposit
depth
describe
description
desert
deserve
design
desire
desk
desperate
dessert
destination
destroy
detective
determine
develop
development
devote
devotion
diagram
dial
dialog
dialogue
diamond
diary
dictation
dictionary
die
diet
differ
difference
different
difficult
difficulty
dig
digest
digital
dignity
dilemma
dimension
dinner
dinosaur
dioxide
dip
diploma
direct
direction
director
directory
dirt
dirty
disability
disabled
disadvantage
disagree
disagreement
disappear
disappoint
disappointed
disaster
disc
discount
discourage
discover
discovery
discrimination
discuss
discussion
disease
disgusting
dish
disk
dislike
dismiss
distance
distant
distinction
distinguish
distribute
district
disturb
disturbing
dive
diverse
divide
division
divorce
dizzy
do
doctor
document
dog
doll
dollar
donate
door
dorm
dormitory
dot
double
doubt
down
download
downstairs
downtown
dozen
dr
draft
drag
draw
drawback
drawer
dream
dress
drill
drink
drive
drop
drug
drum
drunk
dry
duck
due
dull
dumpling
during
dusk
dust
dustbin
dusty
duty
dvd
dynamic
dynasty
each
eager
eagle
ear
early
earn
earth
earthquake
east
easter
eastern
easy
eat
ecology
edge
edition
editor
educate
education
educator
effect
effort
egg
eggplant
either
elder
elect
electric
electrical
electricity
electronic
elegant
elephant
else
embarrass
embassy
emergency
emperor
employ
empty
encourage
encouragement
end
ending
endless
enemy
energetic
energy
engineer
enjoy
enjoyable
enlarge
enough
enquiry
enter
enterprise
entertainment
enthusiastic
entire
entrance
entry
envelope
environment
envy
equal
equality
equip
equipment
eraser
error
erupt
escape
especially
essay
europe
european
evaluate
even
evening
event
ever
every
everybody
everyday
everyone
everything
everywhere
evidence
evident
evolution
exact
exam
examination
examine
example
excellent
except
exchange
excite
excuse
exercise
exhibition
exist
existence
exit
expand
expect
expectation
expense
expensive
experience
experiment
expert
explain
explanation
explicit
explode
explore
export
expose
express
expression
extension
extra
extraordinary
extreme
eye
eyesight
face
facial
fact
factory
fade
fail
failure
fair
faith
fall
false
familiar
family
famous
fan
fancy
fantastic
fantasy
far
fare
farm
farmer
fast
fasten
fat
father
fault
favor
favorite
favour
favourite
fear
feast
feather
federal
fee
feed
feel
feeling
fellow
female
fence
ferry
festival
fetch
fever
few
fiber
fibre
fiction
field
fierce
fight
figure
file
fill
film
final
finance
find
fine
finger
fingernail
finish
fire
fireworks
firm
fish
fist
fit
fix
flag
flame
flash
flashlight
flat
flee
flesh
flexible
flight
float
flood
floor
flour
flow
flower
flu
fluency
fluent
fly
focus
fog
foggy
fold
folk
follow
following
fond
food
fool
foolish
foot
football
for
forbid
force
forecast
forehead
foreign
foreigner
foresee
forest
forever
forget
forgetful
forgive
fork
form
format
former
fortnight
fortunate
fortune
forward
foster
found
fountain
fox
fragile
fragrant
framework
franc
free
freedom
freeway
freeze
freezing
frequent
fresh
friction
fridge
friend
friendly
friendship
frighten
frog
from
front
frontier
frost
fruit
fry
fuel
full
fun
function
fundamental
funeral
funny
fur
furnished
furniture
further
future
gain
gallery
gallon
game
garage
garbage
garden
garlic
garment
gas
gate
gather
gay
general
generation
generous
gentle
gentleman
geography
geometry
gesture
get
gift
gifted
giraffe
girl
give
glad
glance
glare
glass
globe
glory
glove
glue
go
goal
goat
god
gold
golden
golf
good
goods
goose
govern
government
grade
gradual
graduate
graduation
grain
gram
grammar
grand
grandchild
granddaughter
grandfather
grandma
grandmother
grandpa
grandparents
grandson
granny
grape
graph
grasp
grass
grateful
gravity
gray
great
greedy
green
greengrocer
greet
greeting
grey
grill
grocer
grocery
ground
group
grow
growth
guarantee
guard
guess
guest
guidance
guide
guilty
guitar
gun
gym
gymnasium
gymnastics
habit
hair
haircut
half
hall
ham
hamburger
hammer
hand
handbag
handful
handkerchief
handle
handsome
handwriting
handy
hang
happen
happiness
happy
harbor
harbour
hard
hardly
hardship
hardworking
harm
harmful
harmony
harvest
hat
hatch
hate
have
he
head
headache
headline
headmaster
headmistress
health
healthy
hear
hearing
heart
heat
heaven
heavy
heel
height
helicopter
hello
helmet
help
helpful
hen
her
herb
here
hero
hers
herself
hesitate
hi
hide
high
highway
hill
him
himself
hire
his
history
hit
hobby
hold
hole
holiday
holy
home
homeland
hometown
homework
honest
honey
honor
honour
hook
hope
hopeful
hopeless
horrible
horse
hospital
host
hostess
hot
hotdog
hotel
hour
house
housewife
housework
how
however
howl
hug
huge
human
humor
humorous
humour
hundred
hunger
hungry
hunt
hunter
hurricane
hurry
hurt
husband
hydrogen
i
ice
idea
identification
identify
idiom
if
ignore
ill
illegal
illness
imagine
immediately
immigration
import
importance
important
impossible
impress
impression
improve
in
inch
incident
include
income
increase
indeed
independence
independent
indicate
industry
influence
inform
information
initial
injure
injury
ink
inn
innocent
insect
insert
inside
insist
inspect
inspire
instant
instead
institute
institution
instruct
instruction
instrument
insurance
insure
intelligence
intend
intention
interest
interesting
international
internet
interrupt
interval
interview
into
introduce
introduction
invent
invention
invitation
invite
iron
irrigation
is
island
it
its
itself
jacket
jam
jar
jaw
jazz
jeans
jeep
jet
jewellery
jewelry
job
jog
join
joke
journalist
journey
joy
judge
judgement
judgment
juice
jump
jungle
junior
just
justice
kangaroo
keep
kettle
key
keyboard
kick
kid
kill
kilo
kilometer
kind
kindergarten
kindness
king
kingdom
kiss
kitchen
kite
knee
knife
knock
know
knowledge
lab
labor
laboratory
labour
lack
lady
lake
lamb
lame
lamp
land
language
lantern
lap
large
last
late
latter
laugh
laughter
laundry
law
lawyer
lay
lazy
lead
leader
leaf
league
leak
learn
least
leather
leave
lecture
left
leg
legal
lemon
lemonade
lend
length
lesson
let
letter
letters
level
liberation
liberty
librarian
library
license
lid
lie
life
lift
light
lightning
like
likely
limit
line
link
lion
lip
liquid
list
listen
liter
literary
literature
litre
little
live
lively
load
loaf
local
lock
lonely
long
look
loose
lorry
lose
loss
lot
loud
lounge
love
lovely
low
luck
lucky
luggage
lunch
lung
machine
mad
madam
madame
magazine
magic
maid
mail
mailbox
main
mainland
major
majority
make
male
man
manage
manager
mankind
manner
many
map
maple
marathon
marble
march
mark
market
marriage
marry
mask
mass
master
mat
match
material
math
mathematics
maths
matter
mature
maximum
may
maybe
me
meal
mean
meaning
means
meanwhile
measure
meat
medal
media
medical
medicine
medium
meet
meeting
melon
member
memorial
memory
mend
mental
mention
menu
merchant
merciful
mercy
merely
merry
mess
message
messy
metal
meter
method
metre
microscope
microwave
middle
midnight
might
mild
mile
milk
millimeter
millimetre
millionaire
mind
mine
mineral
minibus
minimum
minister
ministry
minority
minus
minute
mirror
miss
missile
mist
mistake
mistaken
misunderstand
mix
mixture
mobile
model
modem
modern
modest
mom
moment
mommy
money
monitor
monkey
month
monument
moon
mop
moral
more
morning
moslem
mosquito
mother
motherland
motivation
motor
motorcycle
motto
mountain
mountainous
mourn
mouse
moustache
mouth
move
movement
movie
much
mud
muddy
multiply
mum
mummy
murder
museum
mushroom
music
musical
musician
must
mustard
mutton
my
myself
nail
name
narrow
nation
national
nationality
nationwide
native
natural
nature
navy
near
nearby
nearly
neat
necessary
neck
necklace
need
needle
negotiate
neighbor
neighborhood
neighbour
neighbourhood
neither
nephew
nervous
nest
net
network
never
new
news
newspaper
next
nice
niece
no
noble
nobody
nod
noise
noisy
none
noodle
noon
nor
normal
north
northeast
northern
northwest
nose
not
note
notebook
nothing
notice
novel
novelist
now
nowadays
nowhere
nuclear
numb
number
nurse
nursery
nut
nutrition
obey
object
observe
obtain
obvious
occupation
occupy
occur
ocean
oceania
of
off
offence
offer
office
officer
official
offshore
often
oh
oil
oilfield
ok
old
olympic
olympics
on
once
one
oneself
onion
only
onto
open
opening
opera
operate
operation
operator
opinion
oppose
opposite
optimistic
optional
or
oral
orange
orbit
order
ordinary
organ
organisation
organise
organization
organize
origin
other
otherwise
ought
our
ours
ourselves
out
outcome
outdoors
outer
outgoing
outing
outline
output
outside
outspoken
outstanding
outward
outwards
oval
over
overcoat
overcome
overhead
overlook
overweight
owe
own
owner
ownership
ox
oxygen
pace
pacific
pack
package
packet
paddle
page
pain
painful
paint
painter
painting
pair
palace
pale
pan
pancake
panda
panic
paper
paperwork
paragraph
parallel
parcel
pardon
parent
park
parking
parrot
part
participate
particular
partly
partner
party
pass
passage
passenger
passive
passport
past
patent
path
patience
patient
pattern
pause
pavement
pay
pc
pea
peace
peaceful
peach
pear
pedestrian
pen
pence
pencil
penny
pension
people
pepper
per
percent
percentage
perfect
perform
performance
performer
perfume
perhaps
period
permanent
permission
permit
person
personal
personally
personnel
persuade
pest
pet
petrol
phenomenon
photo
photograph
photographer
phrase
physical
physician
physicist
physics
pianist
piano
pick
picnic
picture
pie
piece
pig
pile
pill
pillow
pilot
pin
pine
pineapple
pink
pint
pioneer
pipe
pity
place
plain
plan
plane
planet
plant
plastic
plate
platform
play
playground
pleasant
please
pleased
pleasure
plenty
plot
plug
plus
pocket
poem
poet
point
poison
poisonous
pole
police
policeman
policewoman
policy
polish
polite
political
politician
politics
pollute
pollution
pond
pool
poor
pop
popcorn
popular
population
pork
porridge
port
portable
porter
position
positive
possess
possession
possibility
possible
post
postage
postcard
postcode
poster
postman
postpone
pot
potato
potential
pound
pour
powder
power
powerful
practical
practice
practise
praise
pray
prayer
precious
precise
predict
prefer
preference
pregnant
prejudice
premier
preparation
prepare
prescription
present
presentation
preserve
president
press
pressure
pretend
pretty
prevent
preview
price
pride
primary
primitive
principle
print
prison
prisoner
private
privilege
prize
probably
problem
procedure
process
produce
product
production
profession
professor
profit
program
programme
progress
prohibit
project
promise
promote
pronounce
pronunciation
proper
properly
protect
protection
proud
prove
provide
province
psychology
pub
public
publish
pull
pulse
pump
punctual
punctuation
punish
punishment
pupil
purchase
pure
purple
purpose
purse
push
put
puzzle
pyramid
quake
qualification
quality
quantity
quarrel
quarter
queen
question
questionnaire
queue
quick
quiet
quilt
quit
quite
quiz
rabbit
race
racial
radiation
radio
radioactive
radium
rag
rail
railway
rain
rainbow
raincoat
rainfall
rainy
raise
random
range
rank
rapid
rare
rat
rate
rather
raw
ray
razor
reach
react
read
reading
ready
real
realise
reality
realize
really
reason
reasonable
rebuild
receipt
receive
receiver
recent
reception
receptionist
recipe
recite
recognise
recognize
recommend
record
recorder
recover
recreation
rectangle
recycle
red
reduce
refer
referee
reference
reflect
reform
refresh
refrigerator
refuse
regard
regardless
register
regret
regular
regulation
reject
relate
relation
relationship
relative
relax
relay
relevant
reliable
relief
religion
religious
rely
remain
remark
remember
remind
remote
remove
rent
repair
repeat
replace
reply
report
reporter
represent
representative
republic
reputation
request
require
requirement
rescue
research
resemble
reservation
reserve
resign
resist
respect
respond
responsibility
rest
restaurant
restriction
result
retell
retire
return
review
revision
revolution
reward
rewind
rhyme
rice
rich
rid
riddle
ride
ridiculous
right
rigid
ring
ripe
ripen
rise
risk
river
road
roast
rob
robot
rock
rocket
role
roll
roof
room
rooster
root
rope
rose
rot
rough
round
roundabout
routine
row
royal
rubber
rubbish
rude
rugby
ruin
rule
ruler
run
rush
sacred
sacrifice
sad
sadness
safe
safely
sail
sailor
salad
salary
sale
salesgirl
salesman
saleswoman
salt
salty
salute
same
sand
sandwich
satellite
satisfaction
satisfy
saucer
sausage
save
say
saying
scan
scar
scare
scarf
scene
scenery
sceptical
schedule
scholar
scholarship
school
schoolbag
schoolboy
schoolgirl
schoolmate
science
scientific
scientist
scissors
scold
score
scratch
scream
screen
sculpture
sea
seagull
seal
search
seashell
seaside
season
seat
seaweed
second
secret
secretary
section
secure
security
see
seed
seek
seem
seize
seldom
select
selfish
sell
semicircle
seminar
send
senior
sense
sensitive
sentence
separate
separation
serious
servant
serve
service
session
set
settle
settlement
settler
several
sew
sex
shabby
shade
shadow
shake
shall
shallow
shame
shape
share
shark
sharp
sharpen
sharpener
shave
shaver
she
sheep
sheet
shelf
shelter
shine
ship
shirt
shock
shoe
shoot
shop
shopkeeper
shopping
shore
short
shortcoming
shortly
shorts
shot
should
shoulder
shout
show
shower
shrink
shut
shy
sick
sickness
side
sideroad
sidewalk
sideways
sigh
sight
sightseeing
signal
signature
significance
silence
silent
silk
silly
silver
similar
simple
simplify
since
sincerely
sing
single
sink
sir
sister
sit
situation
size
skate
skateboard
skeptical
ski
skilful
skill
skin
skip
skirt
sky
skyscraper
slave
slavery
sleep
sleepy
sleeve
slice
slide
slight
slim
slip
slow
small
smart
smell
smile
smog
smoke
smoker
smooth
snake
sneaker
sneeze
sniff
snow
snowy
so
soap
sob
soccer
social
socialism
socialist
society
sock
socket
sofa
soft
software
soil
solar
soldier
solid
some
somebody
somehow
someone
something
sometimes
somewhere
son
song
soon
sorrow
sorry
sort
soul
sound
soup
sour
south
southeast
southern
southwest
souvenir
sow
space
spaceship
spade
spare
sparrow
speak
speaker
spear
special
specialist
specific
speech
speed
spell
spelling
spend
spin
spirit
spiritual
spit
splendid
split
spoken
spokesman
spokeswoman
sponsor
spoon
spoonful
sport
spot
spray
spread
spring
spy
square
squeeze
squirrel
stable
stadium
staff
stage
stain
stainless
stair
stamp
stand
standard
star
stare
start
starvation
starve
state
statement
statesman
stateswoman
station
statistics
statue
status
stay
steady
steak
steal
steam
steel
steep
step
steward
stewardess
stick
still
stocking
stomach
stone
stop
storage
store
storm
story
stout
stove
straight
straightforward
strait
strange
stranger
straw
strawberry
stream
street
strength
strengthen
stress
strict
strike
string
strong
struggle
stubborn
student
studio
study
stupid
style
subject
subjective
submit
subscribe
substitute
succeed
success
successful
such
suck
sudden
suffer
suffering
sugar
suggest
suggestion
suit
suitable
suitcase
suite
summary
summer
sun
sunburnt
sunlight
sunny
sunshine
super
superb
superior
supermarket
supper
supply
support
suppose
supreme
sure
surface
surgeon
surplus
surprise
surround
surrounding
survival
survive
suspect
suspension
swallow
swap
swear
sweat
sweater
sweep
sweet
swell
swift
swim
swing
switch
sword
symbol
sympathy
symphony
symptom
system
systematic
table
tablet
tail
tailor
take
tale
talent
talk
tall
tank
tap
tape
target
task
taste
tasteless
tasty
tax
taxi
taxpayer
tea
teach
teacher
team
teamwork
teapot
tear
tease
technical
technique
technology
teenager
telephone
telescope
television
tell
temperature
temple
temporary
tend
tendency
tennis
tense
tension
tent
tentative
term
terminal
terrible
terrify
terror
test
text
textbook
than
thank
thankful
that
the
theater
theatre
theft
their
theirs
them
theme
themselves
then
theoretical
theory
there
therefore
thermos
these
they
thick
thief
thin
thing
think
thinking
thirst
this
thorough
those
though
thought
thread
thrill
thriller
throat
through
throughout
throw
thunder
thunderstorm
thus
tick
ticket
tidy
tie
tiger
tight
till
time
timetable
tin
tiny
tip
tire
tired
tiresome
tissue
title
to
toast
tobacco
today
together
toilet
tolerate
tomato
tomb
tomorrow
ton
tongue
tonight
too
tool
tooth
toothache
toothbrush
toothpaste
top
topic
tortoise
total
touch
tough
tour
tourism
tourist
tournament
toward
towards
towel
tower
town
toy
track
tractor
trade
tradition
traditional
traffic
train
training
tram
transform
translate
translation
translator
transparent
transport
trap
travel
traveler
traveller
treasure
treat
treatment
tree
tremble
trend
trial
triangle
trick
trip
trolleybus
troop
trouble
troublesome
trousers
truck
true
truly
trunk
trust
truth
try
tube
tune
turkey
turn
turning
tutor
tv
twice
twin
twist
type
typewriter
typhoon
typical
typist
tyre
ugly
umbrella
unable
unbearable
unbelievable
uncertain
uncle
uncomfortable
unconditional
unconscious
under
underground
underline
understand
undertake
underwear
unemployment
unfair
unfit
unfortunate
uniform
union
unique
unit
unite
universal
universe
university
unless
unlike
unrest
until
unusual
unwilling
up
update
upon
upper
upset
upstairs
upward
upwards
urban
urge
urgent
use
used
useful
useless
user
usual
vacant
vacation
vague
vain
valid
valley
valuable
value
variety
various
vase
vast
vcd
vegetable
vehicle
version
vertical
very
vest
via
vice
victim
victory
video
videophone
view
village
villager
vinegar
violate
violence
violent
violin
violinist
virtue
virus
visa
visit
visitor
visual
vital
vivid
vocabulary
voice
volcano
volleyball
voluntary
volunteer
vote
voyage
wag
wage
waist
wait
waiter
waitress
wake
walk
wall
wallet
walnut
wander
want
war
ward
warehouse
warm
warmth
warn
wash
washroom
waste
watch
water
watermelon
wave
wax
way
we
weak
weakness
wealth
wealthy
wear
weather
web
website
wedding
weed
week
weekday
weekend
weekly
weep
weigh
weight
welcome
welfare
well
west
western
westward
westwards
wet
whale
what
whatever
wheat
wheel
when
whenever
where
wherever
whether
which
whichever
while
whisper
whistle
white
who
whole
whom
whose
why
wide
widespread
widow
wife
wild
wildlife
will
willing
win
wind
window
windy
wine
wing
winner
winter
wipe
wire
wisdom
wise
wish
with
withdraw
within
without
witness
wolf
woman
wonder
wonderful
wood
wool
woolen
woollen
word
work
worker
world
worldwide
worm
worn
worried
worry
worth
worthwhile
worthy
would
wound
wrestle
wrinkle
wrist
write
wrong
yard
yawn
year
yell
yellow
yes
yesterday
yet
yoghurt
you
young
your
yours
yourself
youth
yummy
zebra
zero
zip
zipper
zone
zoo
zoom